### Import usefull modules

In [95]:
import pandas as pd 
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt
from word2number import w2n

### Load the data

In [13]:
df = pd.read_csv('hiring.csv')

In [15]:
df.iloc[0,0] = 'zero'
df.iloc[1,0] = 'one'

In [16]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1        one                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

### Rename the columns names

In [48]:
#rename the columns names
df.rename(columns={'test_score(out of 10)' : 'test_score','interview_score(out of 10)':'interview_score','salary($)':'salary'},inplace=True)

### Find the median value

In [106]:
median_val=df.test_score.median()
median_val

8.0

### Data preprocessing

In [50]:
df.test_score = df.test_score.fillna(median_val)
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1        one         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

### Change value word to number

In [74]:
#number = []
#for i in df.experience:
#    val = w2n.word_to_num(i)
#    number.append(val)
    
#num = pd.DataFrame(number)

In [71]:
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           1         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [75]:
val = linear_model.LinearRegression()
val.fit(df[['experience','test_score','interview_score']],df.salary)

LinearRegression()

In [77]:
val.coef_

array([2952.76492755, 1849.11614228, 2603.77439417])

In [78]:
val.intercept_

13538.758003737654

### predicted value

In [92]:
#predict the salary in USD:
sal1 = val.predict([[2,9,6]])
sal2 = val.predict([[12,10,10]])
print("Salary 1 : ",int(sal1)) 
print("Salary 2 : ",int(sal2))

Salary 1 :  51708
Salary 2 :  93500

In [93]:
#compare predicted values and  original data
df.tail()

   experience  test_score  interview_score  salary
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000